In [21]:
# Import pandas library for data manipulation and analysis
import pandas as pd
# Read the Facebook dataset from a CSV file into a pandas DataFrame
df = pd.read_csv("/Users/rohankondhalkar/Desktop/Pandas/fb.csv")
# Display the entire DataFrame
df

        Date   Price
0  15-Aug-17  171.00
1  16-Aug-17  170.00
2  17-Aug-17  166.91
3  18-Aug-17  167.41
4  21-Aug-17  167.78
5  22-Aug-17  169.64
6  23-Aug-17  168.71
7  24-Aug-17  167.74
8  25-Aug-17  166.32
9  28-Aug-17  167.24

In [22]:
# Shift all values in the dataframe down by 1 position
# This creates a new dataframe where each row contains values from the previous row
# The first row will contain NaN values since there's no previous row
# Useful for calculating differences between consecutive rows or creating lag features
df.shift(1)

        Date   Price
0       None     NaN
1  15-Aug-17  171.00
2  16-Aug-17  170.00
3  17-Aug-17  166.91
4  18-Aug-17  167.41
5  21-Aug-17  167.78
6  22-Aug-17  169.64
7  23-Aug-17  168.71
8  24-Aug-17  167.74
9  25-Aug-17  166.32

In [23]:
# Shift all values in the dataframe down by 2 positions
# This creates a new dataframe where each value appears 2 rows below its original position
# The first 2 rows will contain NaN values
df.shift(2)

        Date   Price
0       None     NaN
1       None     NaN
2  15-Aug-17  171.00
3  16-Aug-17  170.00
4  17-Aug-17  166.91
5  18-Aug-17  167.41
6  21-Aug-17  167.78
7  22-Aug-17  169.64
8  23-Aug-17  168.71
9  24-Aug-17  167.74

In [5]:
df

        Date   Price
0  15-Aug-17  171.00
1  16-Aug-17  170.00
2  17-Aug-17  166.91
3  18-Aug-17  167.41
4  21-Aug-17  167.78
5  22-Aug-17  169.64
6  23-Aug-17  168.71
7  24-Aug-17  167.74
8  25-Aug-17  166.32
9  28-Aug-17  167.24

In [24]:
# Create a new column 'Prev value' that contains the previous row's 'Price' value
# The shift(1) function moves values down by 1 position, creating a lag of 1 row
df['Prev value'] = df['Price'].shift(1)
df  # Display the dataframe with the new column

        Date   Price  Prev value
0  15-Aug-17  171.00         NaN
1  16-Aug-17  170.00      171.00
2  17-Aug-17  166.91      170.00
3  18-Aug-17  167.41      166.91
4  21-Aug-17  167.78      167.41
5  22-Aug-17  169.64      167.78
6  23-Aug-17  168.71      169.64
7  24-Aug-17  167.74      168.71
8  25-Aug-17  166.32      167.74
9  28-Aug-17  167.24      166.32

In [25]:
# Calculate the price change by subtracting the previous value from the current price
# This creates a new column 'Price Change' in the dataframe
df['Price Change'] = df['Price'] - df['Prev value']
df  # Display the dataframe with the new column

        Date   Price  Prev value  Price Change
0  15-Aug-17  171.00         NaN           NaN
1  16-Aug-17  170.00      171.00         -1.00
2  17-Aug-17  166.91      170.00         -3.09
3  18-Aug-17  167.41      166.91          0.50
4  21-Aug-17  167.78      167.41          0.37
5  22-Aug-17  169.64      167.78          1.86
6  23-Aug-17  168.71      169.64         -0.93
7  24-Aug-17  167.74      168.71         -0.97
8  25-Aug-17  166.32      167.74         -1.42
9  28-Aug-17  167.24      166.32          0.92

In [26]:
# Calculate the 5-day percentage return
# Formula: ((Current Price - Price 5 days ago) / Price 5 days ago) * 100
# This creates a new column showing how much the price has changed over a 5-day period as a percentage
df['5 Day % Return'] =( df['Price'] - df['Price'].shift(5))*100/df['Price'].shift(5)
df

        Date   Price  Prev value  Price Change  5 Day % Return
0  15-Aug-17  171.00         NaN           NaN             NaN
1  16-Aug-17  170.00      171.00         -1.00             NaN
2  17-Aug-17  166.91      170.00         -3.09             NaN
3  18-Aug-17  167.41      166.91          0.50             NaN
4  21-Aug-17  167.78      167.41          0.37             NaN
5  22-Aug-17  169.64      167.78          1.86       -0.795322
6  23-Aug-17  168.71      169.64         -0.93       -0.758824
7  24-Aug-17  167.74      168.71         -0.97        0.497274
8  25-Aug-17  166.32      167.74         -1.42       -0.651096
9  28-Aug-17  167.24      166.32          0.92       -0.321850